IDEA Open Model
RigidLink.RigidX Property
Compatible with IDEA StatiCa Beta 20.0
 DOF rigid in X dirrection
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public bool RigidX { get; set; }
Public Property RigidX As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RigidLink Class
IdeaRS.OpenModel.Model Namespace